Tekla Open API Reference for Tekla Structures 2025
OBB.Center Property
 Gets or sets the center point of the box.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point Center { get; set; }
Public Property Center As Point
	Get
	Set
Property Value
Type: Point
Exceptions
Exception | Condition
ArgumentNullException | Thrown when null is assigned to the property.
ArgumentException | Thrown when setting the value fails.
See Also
Reference
OBB Class
Tekla.Structures.Geometry3d Namespace